// © Copyright 2011-2013, 2015-2016 HP Development Company, L.P.

TaskName = "Langaton asennus";
TaskTOCTitle = "HP:n automaattinen langaton yhteys";
ConfirmSettingsTaskName = "Vahvista HP:n automaattinen langaton yhteys";
ConfirmSettingsTaskTOCTitle = "Vahvista langattomat asetukset";
NetworkSelectTaskName = "Valitse verkko";
DeviceDiscoveryTaskName = "Valitse laite";
DeviceDiscoveryTaskTitle = "Valitse määritettävä laite";
ConfigureSettingsTaskName = "Laitemääritykset meneillään";
ResultsTaskName = "Määritystulokset";

// confirmation pane
ConfirmationDescriptionText = "Jos valitset HP:n automaattinen langaton yhteys -toiminnon, tietokoneen langaton verkkoyhteys katkeaa väliaikaisesti, joten suorita mahdolliset käynnissä olevat lataukset loppuun. Keskeytyksen kesto on noin 30 sekuntia ja langaton yhteys muodostetaan uudelleen katkon jälkeen.";
HostNetworkDetectedTitle = "HP-asennusohjelma määritti, että tietokoneesi on yhdistetty langattomaan verkkoon seuraavilla asetuksilla:";
WirelessNetworkNameTitle = "Langattoman verkon nimi:";
CommunicationModeTitle = "Tiedonsiirtotila:";
EncryptionTypeTitle = "Salaustyyppi:";

WirelessNetworkChooseTitle = "Haluatko, että laite määritetään yllä olevien asetusten mukaisesti?";
KeepCurrentNetworkSettingsTitle = "Kyllä, säilytä nämä asetukset.";
ChooseAnotherNetworkSettingsTitle = "Ei, haluan valita toisen verkon.";
ShowSettingsTitle = "Näytä asetukset";

// network selection pane
NetworkSelectTitle = "Valitse langattoman verkon nimi alla olevasta luettelosta.";
SelectedNetworkPasswordTitle = "Salasana:";
NetworkSelectContinueDescription= "Lisää laite verkkoon \"%@\" valitsemalla Jatka.";
NetworkDiscoveryFailedTitle = "Verkon hakeminen epäonnistui";
NetworkDiscoveryFailedDescription = "Langattomia verkkoja ei löydy.";
SetupNetworkSelectedTitle = "Valitse toinen verkko";
SetupNetworkSelectedDescription = "Yrität yhdistää tulostimen luomaan erityisverkkoon. Osoita OK ja valitse jokin toinen verkko.";

NetworkNotAvailableTitle = "Verkko ei ole käytettävissä";
DeviceNetworkNotAvailableMessageFormat = "Laite ei voinut liittyä langattomaan verkkoon \"%@\". Varmista, että langaton tukiasema toimii oikein ja että se on laitteen käyttöetäisyydellä, tai valitse toinen verkko.";
MacNetworkNotAvailableMessageFormat = "Mac ei saanut yhteyttä langattomaan verkkoon \"%@\". Tarkista, että langattoman verkon yhteyspiste toimii moitteetta ja että se on Mac-tietokoneen kantoalueella, tai valitse jokin toinen verkko.";
ChangeNetworkButtonTitle= "Vaihda verkkoa";

LookingForNetworkMessageFormat = "Etsitään verkkoa: \"%@\"";

UnsupportedNetworkTitle = "Verkkoa ei tueta";
UnsupportedNetworkMessageFormat = "Valitse toinen verkko tai pyydä apua verkon järjestelmänvalvojalta.";

EnterpriseNetworkAlertTitle = "Yritysverkko valittu";
EnterpriseNetworkAlertForUSBConnectionMessage = "Tämä verkko on suojattu erään tyyppisellä yrityssalausmenetelmällä. Kytke tulostin samaan verkkoon kuin tietokone ja käytä sitten upotettua Internet-palvelinta tai ota yhteys järjestelmänvalvojaan.";
EnterpriseNetworkAlertForNetworkConnectionMessage = "Tämä verkko on suojattu erään tyyppisellä yrityssalausmenetelmällä. Liitä tulostin verkkoon käyttäen upotettua Internet-palvelinta (EWS) tai ota yhteys järjestelmänvalvojaan. Jos päätät käyttää EWS:ää, tietokone purkaa yhteyden langattomaan verkkoon ja muodostaa yhteyden tulostimelle luotuun erikoisverkkoon.";
ConfigureUsingEWSButtonTitle = "Kokoonpanon määrittäminen EWS:llä";
ConnectingToDeviceProgressTitle = "Muodostetaan yhteyttä laiteverkkoon...";

UnableToConnectToDeviceNetworkAlertMessage = "Varmista, että tietokone voi havaita laitteen ja että laitteen sininen merkkivalo vilkkuu sen merkiksi, että laite on HP:n automaattisessa langattoman yhteyden muodostustilassa. Tämän tilan voi palauttaa käyttämällä laitteen säätimistä Palauta verkon oletusarvot -valintaa. Katso laitteen käyttöohjeista, miten se tehdään.";

// select device
DeviceNameColumnTitle = "Laitteen nimi";
DeviceModelColumnTitle = "Tulostinmalli";
AllFilterTitle = "Kaikki";
DevicesFilterLabel = "Laitteet:";
SupportedDevicesFilterTitle = "Tuettu";

// configure
ConfigureTaskName = "HP-laitteen määritys";
ConfigureTitle = "Määritetään...";
NoteTitle = "Laitteelta saattaa kulua muutama minuutti määrittämiseen ja IP-osoitteen noutamiseen langattomasta tukiasemasta.";
RestoringNetworkSettings = "Verkkoasetuksia palautetaan...";

// particular errors
IncorrectPasswordTitle = "Salasanaa ei hyväksytty.";
IncorrectPasswordDescription = "Langaton verkko \"%@\" ei hyväksynyt salasanaa.\n\nAnna salasana uudelleen.";

DuplicateNetworkNameErrorTitle = "Kopioi WiFi-verkkonimet";
DuplicateNetworkNameErrorDescription = "Useita \"%@\" WiFi-verkkoja havaittu. Tarkista langattoman reitittimen asetukset.";

MacAddressFilterErrorTitle = "WiFi-suodatinvirhe";
MacAddressFilterErrorDescription = "Laitteen MAC-laiteosoite on suodatettu näkyvistä, ja se ei ole saatavilla kohteesta \"%@\". Tarkista langattoman reitittimen asetukset.";

WeakSignalStrengthErrorTitle = "Heikko signaali";
WeakSignalStrengthErrorDescription = "Langattoman \"%@\" -reitittimen signaali on heikko. Aseta laite lähemmäs reititintä.";

DeviceNotReachableErrorTitle = "Laitteeseen ei saada yhteyttä";
DeviceNotReachableErrorDescription = "Langattoman verkon asetukset on ladattu laitteellesi. Mac-tietokoneesi ei kuitenkaan voinut paikallistaa laitetta verkossa.\n\nVarmista seuraavat seikat:\n• Mac on yhteydessä langalliseen tai langattomaan verkkoon, joka voi käyttää laitetta.\n• Laite on yhteydessä langattomaan verkkoon \"%@\".";

EmptyPasswordError = "Salasana annettava.";
TooShortWPAPersonalPasswordError = "Salasanan vähimmäispituus on 8 merkkiä.";
TooLongWPAPersonalPasswordError = "Salasanan enimmäispituus on 64 merkkiä.";

// restore original network errors

FailedToRestoreOriginalNetworkErrorTitle = "Alkuperäistä langattoman verkon yhteyttä ei voi palauttaa";

NoPasswordIsStoredInKeychainErrorMessageFormat = "Avustaja ei voinut noutaa langattoman verkon \"%@\" tunnuksia avainnipustasi. Tarkista, että Mac-tietokoneesi on liitetty langalliseen tai langattomaan verkkoon, josta on käyttöoikeus laitteeseesi.";
PasswordFromKeychainNotAcceptedErrorMessageFormat = "Tunnuksiasi ei hyväksytty langattomaan verkkoon \"%@\". Tarkista, että Mac-tietokoneesi on liitetty langalliseen tai langattomaan verkkoon, josta on käyttöoikeus laitteeseesi.";
FailedToRestoreOriginalNetworkGenericErrorMessage = "Tarkista, että langaton yhteyspiste toimii oikein ja on Mac-tietokoneesi signaalin kantosäteen sisällä. Yritä sitten muodostaa yhteys manuaalisesti.";

// results
ManualNetworkConfigurationTitle = "Manuaalinen";
AutoNetworkConfigurationTitle = "Automaattinen";
LinklocalNetworkConfigurationTitle = "Linkki paikallinen";
NetworkSettingsTitle = "Verkkoasetukset";
ConfigurationFailedTaskName = "Määritys epäonnistui";
ConfigurationCompleteTaskName = "Määritys suoritettu";
ConfigurationFailedTitle = "Avustaja ei onnistunut määrittämään laitteen asetuksia langattoman yhteyden välityksellä.";
ConfigurationSucceededTitle = "HP-laitteen määritykset on nyt tehty ja laite on yhdistetty verkkoon \"%@\".";

ConfigurationFailedNote = "Tarkista, että langaton tukiasema toimii oikein ja että laitteesi on sen toimintasäteellä. Tarkista myös, että laite on päällä muttei käytössä, ja yritä sitten uudelleen valitsemalla Yritä uudelleen.\n\n%@";
UnableToConnectToDeviceNetworkUSBSOWMessage = "Varmista, että laitteeseen on kytketty virta ja että tietokone voi havaita sen. Osoita sitten Yritä uudelleen. Laitteen sinisen merkkivalon pitäisi vilkkua sen merkiksi, että laite on HP:n automaattisessa langattoman yhteyden muodostustilassa. Kun laite käynnistetään ensimmäistä kertaa asennuksen aikana, se pysyy yhteydenmuodostustilassa enintään tunnin, kunnes se yhdistetään verkkoon.\n\n%@";
UnableToConnectToDeviceNetworkFPWithoutIndicatorSOWMessage = "Varmista, että laite on tämän tietokoneen näkyvissä ja että laite on HP Auto Wireless Connect tilassa. Yritä sitten uudelleen napsauttamalla Yritä uudelleen. Voit nollata HP Auto Wireless Connect -tilan käyttämällä laitteen ohjauspaneelin Palauta verkon oletusasetukset -vaihtoehtoa. Katso ohjeita sen tekemisestä laitteen käyttöohjeista.\n\n%@";
UnableToConnectToDeviceNetworkFPWithIndicatorSOWMessage = "Varmista, että tietokone voi havaita laitteen ja että laitteen sininen merkkivalo vilkkuu sen merkiksi, että laite on HP:n automaattisessa langattoman yhteyden muodostustilassa. Osoita sitten Yritä uudelleen. HP:n automaattisen langattoman yhteyden muodostustilan voi palauttaa käyttämällä laitteen säätimistä Palauta verkon oletusarvot -valintaa. Katso laitteen käyttöohjeista, miten se tehdään.\n\n%@";

ConfigurationFailedUSBSOWPart = "Voit määrittää laitteen asetukset myös yhdistämällä laitteen tietokoneeseen USB-johdolla ja valitsemalla Yritä uudelleen. Kun laite on määritetty muodostamaan yhteys aiemmin valitsemaasi verkkoon, voit irrottaa sen tietokoneesta.";
ConfigurationFailedFPSOWPart = "Voit myös määrittää laitteesi muodostamaan yhteyden langattomaan verkkoon käyttämällä langattoman yhteyden ohjattua määritystoimintoa, joka käynnistetään laitteen ohjauspaneelin kautta seuraavasti:
       1. Paina langattoman painiketta tai napauta laitteen Langaton-kuvaketta.
       2. Avaa laitteen näytöstä langattoman tilan näyttö ja valitse Asetukset.
       3. Valitse langattoman yhteyden ohjattu määritystoiminto ja noudata näytöllä näkyviä ohjeita.


Kun ohjatun toiminnon suorittaminen on onnistunut, laitteesi muodostaa automaattisesti verkkoyhteyden.";

ConfigurationOverUSBFailedTitle = "Avustaja ei onnistunut määrittämään laitteen asetuksia USB-yhteyden välityksellä.";
ConfigurationOverUSBFailedNote = "Tarkista, että langaton tukiasema toimii oikein ja että laitteesi on sen toimintasäteellä. Tarkista myös, että laite on päällä muttei käytössä, ja yritä sitten uudelleen valitsemalla Yritä uudelleen.";
MoreInfoText = "Lisätietoja löytyy osoitteesta";
FailedTitle = "Verkkotietojen haku ei onnistunut";
BonjourServiceNameLabel = "Bonjour-palvelun nimi:";
IPAddress = "IP-osoite:";
AddressMode = "Osoitetila:";
SubnetMask = "Aliverkon peite:";
DefaultGateway = "Oletusyhdyskäytävä:";
HostName = "Isännän nimi:";
PrefixLength = "Etuliitteen pituus:";
DisconnectUSBWarningText = "<b>Tärkeää:</b> Irrota laitteeseesi yhdistetty USB-johto nyt.";
DeviceNotLocatedWarningText = "Laitteeseen ladattiin langattoman verkon asetukset. Mac-tietokone ei kuitenkaan onnistunut löytämään laitetta verkosta.";

// network settings
Adhoc = "Adhoc";
Infrastructure = "Infrastruktuuri";

// select network
NetworkColumnTitle = "Verkko";
SignalStrengthColumnTitle = "Signaalin vahvuus";
EncryptionColumnTitle = "Salaus";
ModeColumnTitle = "Tila";
